"""
1. Реализовать скрипт, в котором должна быть предусмотрена функция расчета заработной платы сотрудника.
В расчете необходимо использовать формулу: (выработка в часах * ставка в час) + премия.
Для выполнения расчета для конкретных значений необходимо запускать скрипт с параметрами.
"""
from sys import argv

hours, payment_per_hour, bonus = argv
hours
month_payment = payment_per_hour * hours + bonus

print('Зарплата за месяц')
print(month_payment)